[
 {
  "title": "Donald Trump",
  "date": "24th September 2022",
  "body": [
   "",
   "Donald Trump",
   "Official White House presidential portrait. Head shot of Trump smiling in front of the U.S. flag, wearing a dark blue suit jacket with American flag lapel pin, white shirt, and light blue necktie.",
   "Official portrait, 2017",
   "45th President of the United States",
   "In office",
   "January 20, 2017 – January 20, 2021",
   "Vice President\tMike Pence",
   "Preceded by\tBarack Obama",
   "Succeeded by\tJoe Biden",
   "Personal details",
   "Born\tDonald John Trump",
   "June 14, 1946 (age 76)",
   "Queens, New York City, U.S.",
   "Political party\tRepublican (1987–1999, 2009–2011, 2012–present)",
   "Other political",
   "affiliations\t",
   "Reform (1999–2001)",
   "Democratic (2001–2009)",
   "Independent (2011–2012)",
   "Spouses\t",
   "Ivana Zelníčková",
   "​",
   "​(m. 1977; div. 1992)​",
   "Marla Maples",
   "​",
   "​(m. 1993; div. 1999)​",
   "Melania Knauss ​(m. 2005)​",
   "Children\t",
   "Donald Jr. Ivanka Eric Tiffany Barron",
   "Parents\t",
   "Fred Trump",
   "Mary Anne MacLeod",
   "Relatives\tFamily of Donald Trump",
   "Residence\tMar-a-Lago",
   "Alma mater\tWharton School (BS Econ.)",
   "Occupation\t",
   "Politicianbusinessmanmedia personality",
   "Awards\tList of awards and honors",
   "Signature\tDonald J. Trump stylized autograph, in ink",
   "Website\t",
   "Official website",
   "Presidential Library",
   "White House Archives",
   "Donald Trump official portrait (cropped).jpg\t",
   "This article is part of ",
   "a series about",
   "Donald Trump",
   "show",
   "Business and personal",
   "show",
   "45th President of the United States",
   "show",
   "Tenure",
   "show",
   "Policies",
   "show",
   "Appointments",
   "show",
   "Presidential campaigns",
   "show",
   "Impeachments",
   "show",
   "Interactions involving Russia",
   "show",
   "COVID-19 pandemic",
   "Seal of the President of the United States",
   "vte",
   "Donald John Trump (born June 14, 1946) is an American politician, media personality, and businessman who served as the 45th president of the United States from 2017 to 2021.",
   "",
   "Trump graduated from the Wharton School of the University of Pennsylvania with a bachelor's degree in 1968. He became president of his father's real estate business in 1971 and renamed it The Trump Organization. He expanded the company's operations to building and renovating skyscrapers, hotels, casinos, and golf courses. He later started side ventures, mostly by licensing his name. From 2004 to 2015, he co-produced and hosted the reality television series The Apprentice. Trump and his businesses have been involved in more than 4,000 state and federal legal actions, including six bankruptcies.",
   "",
   "Trump's political positions have been described as populist, protectionist, isolationist, and nationalist. He won the 2016 United States presidential election as the Republican nominee against Democratic nominee Hillary Clinton despite losing the popular vote.[a] He became the first U.S. president with no prior military or government service. His election and policies sparked numerous protests. The 2017–2019 special counsel investigation led by Robert Mueller established that Russia interfered in the 2016 election to favor the election of Trump. Trump promoted conspiracy theories and made many false and misleading statements during his campaigns and presidency, to a degree unprecedented in American politics. Many of his comments and actions have been characterized as racially charged or racist, and many as misogynistic."
  ]
 }
]